backend: tensorflow
class_name: Sequential
config:
- class_name: Bidirectional
  config:
    batch_input_shape: !!python/tuple [null, 10, 14]
    dtype: float32
    layer:
      class_name: LSTM
      config:
        activation: tanh
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        dropout: 0.3
        go_backwards: false
        implementation: 1
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        name: lstm_2
        recurrent_activation: hard_sigmoid
        recurrent_constraint: null
        recurrent_dropout: 0.3
        recurrent_initializer:
          class_name: Orthogonal
          config: {gain: 1.0, seed: null}
        recurrent_regularizer: null
        return_sequences: true
        return_state: false
        stateful: false
        trainable: true
        unit_forget_bias: true
        units: 14
        unroll: false
        use_bias: true
    merge_mode: sum
    name: bidirectional_3
    trainable: true
- class_name: Bidirectional
  config:
    layer:
      class_name: GRU
      config:
        activation: tanh
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        dropout: 0.3
        go_backwards: false
        implementation: 1
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: normal, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        name: gru_2
        recurrent_activation: hard_sigmoid
        recurrent_constraint: null
        recurrent_dropout: 0.3
        recurrent_initializer:
          class_name: Orthogonal
          config: {gain: 1.0, seed: null}
        recurrent_regularizer: null
        reset_after: false
        return_sequences: false
        return_state: false
        stateful: false
        trainable: true
        units: 14
        unroll: false
        use_bias: true
    merge_mode: sum
    name: bidirectional_4
    trainable: true
- class_name: Dense
  config:
    activation: linear
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: normal, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_2
    trainable: true
    units: 3
    use_bias: true
keras_version: 2.1.5
